export function getAsciimojiAtIndex(index: number): string {
  if (index >= 0 && index < asciimojisShortlist.length) {
    return asciimojisShortlist[index];
  }
  return "";
}

export function getRandomAsciimoji(): string {
  const randomIndex = Math.floor(Math.random() * asciimojisShortlist.length);
  return asciimojisShortlist[randomIndex];
}

const asciimojisShortlist = ["／人◕ __ ◕人＼", "(ﾉ◕ヮ◕)ﾉ*:・ﾟ✧", "(*・‿・)ノ⌒*:･ﾟ✧", "(ﾉ☉ヮ⚆)ﾉ ⌒*:･ﾟ✧", "¯\\_( ͡° ͜ʖ ͡°)_/¯", "(=^･ｪ･^=))ﾉ彡☆", "ლ(`◉◞౪◟◉‵ლ)", "⊹╰(⌣ʟ⌣)╯⊹"];

export const asciimojisCount = asciimojisShortlist.length;

const asciimojis = ["⊂(◉‿◉)つ", "(ㆆ _ ㆆ)", "☜(⌒▽⌒)☞", "•`_´•", "⤜(ⱺ ʖ̯ⱺ)⤏", "(‿|‿)", "•͡˘㇁•͡˘", "/|\\ ^._.^ /|\\", "ʕ·͡ᴥ·ʔ", "ʕっ•ᴥ•ʔっ", "( 0 _ 0 )", "(˵ ͡° ͜ʖ ͡°˵)", "( •͡˘ _•͡˘)ノð", "( ˘ ³˘)ノ°ﾟº❍｡", "(= ФェФ=)", "( ͡° ᴥ ͡°)", "※\\(^o^)/※", "╭(ʘ̆~◞౪◟~ʘ̆)╮", "(͡ ° ͜ʖ ͡ °)", "ԅ(≖‿≖ԅ)", "( ✜︵✜ )", "(╥﹏╥)", "(｡◕‿‿◕｡)", "ヽ( •_)ᕗ", "(ᕗ ͠° ਊ ͠° )ᕗ", "(︶︹︶)", "☉ ‿ ⚆", "d[-_-]b", "(◕ᴥ◕ʋ)", "ヽ༼ຈل͜ຈ༽ﾉ", "(- ʖ̯-)", "ヽ(｀Д´)ﾉ", "<(^_^)>", "(・3・)", "(≧︿≦)", "¯\\(°_o)/¯", "(҂◡_◡) ᕤ", "ψ(｀∇´)ψ", "(͠≖ ͜ʖ͠≖)", "(ﾉ◕ヮ◕)ﾉ*:・ﾟ✧", "(－‸ლ)", "(ˆ⺫ˆ๑)<3", "(ง •̀_•́)ง", "| (• ◡•)|", "ᕙ(`▽´)ᕗ", "(✿◠‿◠)", "─=≡Σ((( つ◕ل͜◕)つ", "(ღ˘⌣˘ღ)", "= _ =", "༼ つ ╹ ╹ ༽つ", "(´・ω・)っ由", "༼ つ ◕_◕ ༽つ", "(•-•)⌐", "(*・‿・)ノ⌒*:･ﾟ✧", "(ﾉ☉ヮ⚆)ﾉ ⌒*:･ﾟ✧", "(з๏ε)", "( ´◔ ω◔`) ノシ", "٩(^‿^)۶", "٩( ๑╹ ꇴ╹)۶", "ᕕ( ᐛ )ᕗ", "(ʘ‿ʘ)╯", "\\(°Ω°)/", "( ｀皿´)｡ﾐ/", "(づ｡◕‿‿◕｡)づ", "┐｜･ิω･ิ#｜┌", "୧(▲ᴗ▲)ノ", "(っ´ω`c)♡", "(❍ᴥ❍ʋ)", "≧◡≦", "(づ ￣ ³￣)づ", "／人◕ ‿‿ ◕人＼", "( ͡° ͜ʖ ͡°)", "[̲̅$̲̅(̲̅ ͡° ͜ʖ ͡°̲̅)̲̅$̲̅]", "(ง ͠° ͟ʖ ͡°)ง", "¯\\_( ͡° ͜ʖ ͡°)_/¯", "ᕦ( ͡° ͜ʖ ͡°)ᕤ", "L(° O °L)", "(ಡ_ಡ)☞", "ᕦ(⩾﹏⩽)ᕥ", "♥‿♥", "ʕ♥ᴥ♥ʔ", "꒰ ꒡⌓꒡꒱", "-`ღ´-", "\\(°^°)/", "ಠ_ಠ", "ಡ_ಡ", "༼ ༎ຶ ෴ ༎ຶ༽", "(⌐⊙_⊙)", "( ͡° ͜ °)", "→_←", "／人◕ __ ◕人＼", "(っˆڡˆς)", "( º﹃º )", "(눈_눈)", "(◞థ౪థ)ᴖ", "✌(-‿-)✌", "(˶‾᷄ ⁻̫ ‾᷅˵)", "(☞ﾟヮﾟ)☞", "ʕ •́؈•̀)", "(☝ ՞ਊ ՞)☝", "O=('-'Q)", "t(ಠ益ಠt)", "(=^･ｪ･^=))ﾉ彡☆", "୧༼ಠ益ಠ༽୨", "(◔_◔)", "✿ڿڰۣ—", "(╯°□°)╯", "ε(´סּ︵סּ`)з", "ヽ༼ຈʖ̯ຈ༽ﾉ", "( ͡° ʖ̯ ͡°)", "╚(•⌂•)╝", "¯\\_(ツ)_/¯", "=^_^=", "(;´༎ຶД༎ຶ`)", "ᕙ(⇀‸↼‶)ᕗ", "(๑•́ ヮ •̀๑)", "\\_(-_-)_/", "(ಥ﹏ಥ)", "୧༼ಠ益ಠ༽︻╦╤─", "\\(^-^)/", "( ͡° ͜ʖ ͡°)_/¯", "|=-(¤)-=|", "(=____=)", "☜(꒡⌓꒡)", "ᕦ(òᴥó)ᕥ", "(๑•̀ㅂ•́)ง✧", "( * ^ *) ノシ", "(っ^з^)♪♬", "(°o•)", "ლ(`◉◞౪◟◉‵ლ)", "(⊙＿⊙')", "⊙ω⊙", "\\( ﾟヮﾟ)/", "(•̀ᴗ•́)و ̑̑", "ლ༼>╭ ͟ʖ╮<༽ლ", "⊹╰(⌣ʟ⌣)╯⊹", "[¬º-°]¬"];
